# Outlier

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r"C:\Users\User\Desktop\Anindita Mitra\Dataset\PlayerOutlier.csv")

In [3]:
df

   Player Name  Goal Score
0  Eden Hazard           1
1       Giroud           8
2      Willian           5
3        Kante           7
4         Kepa          24
5        Zouma          11
6         Luiz           2

In [4]:
max_threshold = df['Goal Score'].quantile(0.95)

In [5]:
max_threshold

20.09999999999999

In [6]:
df[df['Goal Score']>max_threshold]

  Player Name  Goal Score
4        Kepa          24

In [7]:
min_threshold = df['Goal Score'].quantile(0.05)

In [8]:
min_threshold

1.3

In [9]:
df[df['Goal Score']<min_threshold]

   Player Name  Goal Score
0  Eden Hazard           1

In [10]:
df[(df['Goal Score']>max_threshold) & (df['Goal Score']<min_threshold)]

Empty DataFrame
Columns: [Player Name, Goal Score]
Index: []

-- --

# Removing Outliers using Percentile

In [15]:
import pandas as pd
import numpy as np

In [11]:
df = pd.read_csv(r"C:\Users\User\Desktop\Anindita Mitra\Dataset\Car_Sales.csv")

In [37]:
df

    Items Sold  Expense    Sales  Profit
0           32     5800  1800000  192000
1           35     6200  1790000  190400
2           38     6400  1780000  191200
3           41     6500  1778000  177600
4           44     6550  1750000  176800
5           47     6580  1740000  178400
6           50     8200  1725000  180800
7           53     8600  1725000  175200
8           56     8800  1720000  174400
9           59     9200  1705000  173920
10          62     9630  1710000  172800
11          65    10570  1700000  163200
12          68    11330  1695000  161600
13          71    11600  1695000  161600
14          74    11800  1690000  160800
15          77    11830  1630000  159200
16          80    12650  1640000  148800
17          83    13000  1635000  115696
18          86    13224  1630000  147200
19          89    13766  1620000  150400
20          92    14010  1615000  152000
21          95    14468  1605000  136000
22          98    15000  1590000  126240
23         101    15200  1595000  123888
24         104    15600  1590000  126080
25         107    16000  1600000  151680
26         110    16200  1610000  152800

In [16]:
df.shape

(27, 4)

In [17]:
df.describe()

       Items Sold       Expense         Sales         Profit
count   27.000000     27.000000  2.700000e+01      27.000000
mean    71.000000  11063.259259  1.680111e+06  160026.074074
std     23.811762   3416.627944  6.780307e+04   21301.097303
min     32.000000   5800.000000  1.590000e+06  115696.000000
25%     51.500000   8400.000000  1.617500e+06  149600.000000
50%     71.000000  11600.000000  1.695000e+06  161600.000000
75%     90.500000  13888.000000  1.725000e+06  176000.000000
max    110.000000  16200.000000  1.800000e+06  192000.000000

In [18]:
#define Min_threshold and max_threshold
min_threshold, max_threshold = df.Profit.quantile([0.001, 0.999])

In [19]:
min_threshold, max_threshold

(115908.992, 191979.2)

In [20]:
#Identify Min Threshold value
df[df['Profit']<min_threshold]

    Items Sold  Expense    Sales  Profit
17          83    13000  1635000  115696

In [22]:
#Identify Max Threshold value
df[df['Profit']>max_threshold]

   Items Sold  Expense    Sales  Profit
0          32     5800  1800000  192000

In [33]:
#create a new data frame where value
df2 = df[(df['Profit']<max_threshold) & (df['Profit']>min_threshold)]

In [34]:
df2.shape

(25, 4)

In [36]:
#New Data Frame has removed Line#0 and Line# 17
df2

    Items Sold  Expense    Sales  Profit
1           35     6200  1790000  190400
2           38     6400  1780000  191200
3           41     6500  1778000  177600
4           44     6550  1750000  176800
5           47     6580  1740000  178400
6           50     8200  1725000  180800
7           53     8600  1725000  175200
8           56     8800  1720000  174400
9           59     9200  1705000  173920
10          62     9630  1710000  172800
11          65    10570  1700000  163200
12          68    11330  1695000  161600
13          71    11600  1695000  161600
14          74    11800  1690000  160800
15          77    11830  1630000  159200
16          80    12650  1640000  148800
18          86    13224  1630000  147200
19          89    13766  1620000  150400
20          92    14010  1615000  152000
21          95    14468  1605000  136000
22          98    15000  1590000  126240
23         101    15200  1595000  123888
24         104    15600  1590000  126080
25         107    16000  1600000  151680
26         110    16200  1610000  152800

In [38]:
df2.shape

(25, 4)